Autodesk.Revit.DB.Mechanical.DuctPressureDropData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Coefficient
The coefficient of the duct.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.PressureDrop
The pressure drop of the duct. Units: (kg/(ft·s²)).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Friction
The friction of the duct. Units: (kg/(ft²·s²)).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.VelocityPressure
The velocity pressure of the duct. Units: (kg/(ft·s²)).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Velocity
The velocity of the duct. Units: (ft/s).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.ReynoldsNumber
The reynolds number of the duct.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.HydraulicDiameter
The hydraulic diameter of the duct. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.EquivalentDiameter
The equivalent diameter of the duct. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Flow
The flow of the duct. Units: (ft³/s).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Roughness
The roughness of the duct. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Viscosity
The viscosity of the duct. Units: (kg/(ft·s)).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Density
The density of the duct.Units: (kg/ft³).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Length
The length of the duct. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.WidthOrDiameter
The diameter of the duct with round profile, or the width of the duct with other profiles. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Height
The height of the duct. If the duct is round, it will be equal to the diameter of the duct. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.CategoryId
The category id of duct curves. It will be OST_DuctCurves, OST_FlexDuctCurves, or OST_PlaceHolderDucts.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Shape
The profile type of the duct.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Level
The calculation level of the system.
Remarks:
If the calculation level is Flow, all parameters that need friction will be displayed as "Not Computed" in Properties dialog (Friction, Pressure Drop, Loss Coefficient).
If the calculation level is None, all parameters that need flow will be displayed as "Not Computed" in Properties dialog (Velocity, Velocity Pressure, Reynolds number, Friction, Pressure Drop, Loss Coefficient).
If the calculation level is All, all parameters will be displayed with their actual values in Properties dialog.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctPressureDropData
The input and output data used by external servers for calculation of the duct pressure drop.
Remarks:
Profile type, Height, Diameter for round profile or width for other profiles, Length, Density, Viscosity, Roughness and Flow are input field values for the calculation. EquivalentDiameter, HydraulicDiameter, ReynoldsNumber, Velocity, VelocityPressure, Friction, PressureDrop, and Coefficient are output field values for the calculation
Since:
2014